using System;
using System.Collections.Generic;
using System.Text;

using DSSAlternative.AHP;
using Microsoft.VisualStudio.TestTools.UnitTesting;

namespace DSSViewTests
{
    [TestClass]
    class DSSAlternativeTest
    {
        //Проверить, все создаваемые задачи корректны

        //Образцовый пример корректен, верно рассчитывает коэффициенты
        //Пример с подкритериями корректен, верно рассчитывает коэффициенты

        //Верно рассчитывается отношение согласованности
        //Верно считаются коэффициенты при изменении отношений

        //Создать некорретную иерархию, проверить её некорретность


        //Проверить количество всех создаваемых отношений
        //Проверить количество требуемых отношений

        //Проверить предупреждение о незаполненности отношений для образцовой проблемы
        //Проверить предупреждение о несогласованности отношений

        //Проверить, что для всех отношений есть зеркальное
        //Проверить, что при изменении отношения оно изменяется зеркально
    }
}
