using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace DSSAlternative.Tests
{
    class RelationsTest
    {
        //Relations
        //Кол-во всех отношений соответствует ожидаемому

        //Коэффициенты соответствуют ожиданиям в простой иерархии
        //Коэффициенты соответствуют ожиданиям в продвинутой иерархии
        //Коэффициенты соответствуют ожиданиям в простой большой иерархии

        //Коэффициенты обновляются при изменении отношения

        //некорректны при неизвестном критерии
        //некорректны при несогласованной критерии
        //корректны если всё норм

        //Изменить зависимость в расчетах матриц от сгруппированных отношений

        //Заполняются из шаблона ожидаемым образом
    }
}
